Revit 2027 API
BuiltInFailures.IlluminationFailures.LightingFixtureLumensWarning Property
 Estimated Illumination failed. Lumens not set for lighting fixture.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId LightingFixtureLumensWarning { get; }
Public Shared ReadOnly Property LightingFixtureLumensWarning As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ LightingFixtureLumensWarning {
	FailureDefinitionId^ get ();
}
static member LightingFixtureLumensWarning : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.IlluminationFailures Class
Autodesk.Revit.DB Namespace